IdeaRS.OpenModel.Geometry3D.CoordSystemByPoint
Coordinates system defid by the point and the plane

IdeaRS.OpenModel.Geometry3D.CoordSystemByPoint.Point
Point where Y o Z axis is located

IdeaRS.OpenModel.Geometry3D.CoordSystemByPoint.InPlane
Point is in Plane